cats_99/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (3) LIMIT $1  [["LIMIT", 1]]